In [1]:
import impyte
reload(impyte)
import pandas as pd
from tools.data_prep import remove_random

In [2]:
data = pd.read_csv('data/hr_test.csv')

In [3]:
data.head()

,satisfaction_level,last_evaluation,number_project,average_montly_hours,time_spend_company,Work_accident,left,promotion_last_5years,sales,salary
0,0.38,0.53,2,157,3,0,1,0,sales,low
1,0.80,0.86,5,262,6,0,1,0,sales,medium
2,0.11,0.88,7,272,4,0,1,0,sales,medium
3,0.72,0.87,5,223,5,0,1,0,sales,low
4,0.37,0.52,2,159,3,0,1,0,sales,low

In [4]:
data = remove_random(data, .25)

In [5]:
data.head()

,satisfaction_level,last_evaluation,number_project,average_montly_hours,time_spend_company,Work_accident,left,promotion_last_5years,sales,salary
0,NaN,0.51,2.0,155.0,3.0,0.0,1.0,0.0,technical,medium
1,NaN,0.56,2.0,157.0,3.0,0.0,1.0,0.0,sales,low
2,NaN,0.47,2.0,135.0,3.0,0.0,1.0,0.0,sales,low
3,NaN,0.47,2.0,158.0,3.0,0.0,1.0,0.0,product_mng,low
4,NaN,0.47,2.0,131.0,3.0,0.0,1.0,0.0,accounting,low

In [29]:
reload(impyte)
imputer = impyte.Imputer()
nan_checker = impyte.NanChecker()
pattern_log = impyte.Pattern()

In [7]:
%timeit nan_checker.is_nan(["", 'None', 'NaN'])
%timeit nan_checker.is_nan(["", 'None', 'NaN'], nan_vals=['', None, 'None', 'NaN'])

100000 loops, best of 3: 5.13 µs per loop
100000 loops, best of 3: 5.09 µs per loop

In [8]:
# Showcase nan_check
%timeit pattern_log.row_nan_pattern(['yes', 'no', '', None])

100000 loops, best of 3: 8.42 µs per loop

In [9]:
%timeit pattern_log.print_pattern(data)

1 loop, best of 3: 755 ms per loop

In [10]:
%timeit pattern_log.pattern(data)

1 loop, best of 3: 1.71 s per loop

In [31]:
pattern_log.compute_pattern(data)['table']

,satisfaction_level,last_evaluation,number_project,average_montly_hours,time_spend_company,Work_accident,left,promotion_last_5years,sales,salary,Count
10,1,1,1,1,1,1,1,1,1,1,11259
8,1,1,1,1,1,1,1,1,NaN,1,374
3,1,1,1,NaN,1,1,1,1,1,1,374
2,1,1,NaN,1,1,1,1,1,1,1,374
9,1,1,1,1,1,1,1,1,1,NaN,374
7,1,1,1,1,1,1,1,NaN,1,1,374
4,1,1,1,1,NaN,1,1,1,1,1,374
0,NaN,1,1,1,1,1,1,1,1,1,374
1,1,NaN,1,1,1,1,1,1,1,1,374
5,1,1,1,1,1,NaN,1,1,1,1,374
6,1,1,1,1,1,1,NaN,1,1,1,374

In [32]:
imputer.load_data(data)

In [33]:
imputer.pattern()

,satisfaction_level,last_evaluation,number_project,average_montly_hours,time_spend_company,Work_accident,left,promotion_last_5years,sales,salary,Count
10,1,1,1,1,1,1,1,1,1,1,11259
8,1,1,1,1,1,1,1,1,NaN,1,374
3,1,1,1,NaN,1,1,1,1,1,1,374
2,1,1,NaN,1,1,1,1,1,1,1,374
9,1,1,1,1,1,1,1,1,1,NaN,374
7,1,1,1,1,1,1,1,NaN,1,1,374
4,1,1,1,1,NaN,1,1,1,1,1,374
0,NaN,1,1,1,1,1,1,1,1,1,374
1,1,NaN,1,1,1,1,1,1,1,1,374
5,1,1,1,1,1,NaN,1,1,1,1,374
6,1,1,1,1,1,1,NaN,1,1,1,374

In [35]:
imputer.get_pattern(0).head()

,satisfaction_level,last_evaluation,number_project,average_montly_hours,time_spend_company,Work_accident,left,promotion_last_5years,sales,salary
0,NaN,0.51,2.0,155.0,3.0,0.0,1.0,0.0,technical,medium
1,NaN,0.56,2.0,157.0,3.0,0.0,1.0,0.0,sales,low
2,NaN,0.47,2.0,135.0,3.0,0.0,1.0,0.0,sales,low
3,NaN,0.47,2.0,158.0,3.0,0.0,1.0,0.0,product_mng,low
4,NaN,0.47,2.0,131.0,3.0,0.0,1.0,0.0,accounting,low

In [93]:
def migratoryBirds(n, ar):
    # Complete this function
    bird_cage = [0]*6
    for bird in ar:
        bird_cage[bird] += 1
    max_val = 0
    max_birds = []
    for typex, countx in enumerate(bird_cage):
        if countx > max_val:
            max_val = countx
            max_birds = [typex]
        elif countx == max_val:
            max_birds.append(typex)
        
    for bird in ar:
        if bird in max_birds:
            return bird